wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
#if 0  /* not used */
/**
  * @brief      Issue Write Status Register #3 command.
  * @param      dataBuf     Transmit buffer.
  * @param      u32NTx      Size of transmit buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
static void SPIM_WriteStatusRegister3(uint8_t dataBuf[], uint32_t u32NTx, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = {OPCODE_WRSR3, 0x00U};    /* 1-byte Write Status Register #2 command + 1-byte data. */
    cmdBuf[1] = dataBuf[0];

    SPIM_SET_SS_EN(1);                          /* CS activated. */
    SwitchNBitOutput(u32NBit);
    spim_write(cmdBuf, sizeof(cmdBuf));
    SPIM_SET_SS_EN(0);                          /* CS deactivated. */
}
#endif

/**
  * @brief      Issue Read Config Register #3 command.
  * @param      dataBuf     Receive buffer.
  * @param      u32NRx      Size of receive buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
static void SPIM_ReadStatusRegister3(SPIM_T *spim, uint8_t dataBuf[], uint32_t u32NRx, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = {OPCODE_RDSR3};              /* 1-byte Read Status Register #1 command. */

    SPIM_SET_SS_EN(spim, 1);                        /* CS activated. */

    SwitchNBitOutput(spim, u32NBit);
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SwitchNBitInput(spim, u32NBit);
    spim_read(spim, dataBuf, u32NRx);

    SPIM_SET_SS_EN(spim, 0);                        /* CS deactivated. */
}

/**
  * @brief      Read Micron MT35X Octal SPI Flash Flag Status Register.
  * @param      spim
  * @param      dataBuf     Receive buffer.
  * @param      u32NRx      Receive Length.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
static void SPIM_ReadMT35XFlagRegister(SPIM_T *spim, uint8_t dataBuf[], uint32_t u32NRx, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = {0x70};           /* 1-byte Read Status Register #1 command. */

    SPIM_SET_SS_EN(spim, 1);                          /* CS activated. */

    SwitchNBitOutput(spim, u32NBit);
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SwitchNBitInput(spim, u32NBit);
    spim_read(spim, dataBuf, u32NRx);

    SPIM_SET_SS_EN(spim, 0);                          /* CS deactivated. */
}

void SPIM_MT35x_4Bytes_Enable(SPIM_T *spim, int isEn, uint32_t u32NBit, uint32_t u32DTRMode)
{
    uint8_t cmdBuf[2] = {0};
    uint8_t u8CmdSize = 1;

    SPIM_SET_DTR_MODE(spim, u32DTRMode); /* DTR Activated. */

    cmdBuf[0] = isEn ? OPCODE_EN4B : OPCODE_EX4B;

    if (u32DTRMode == 1)
    {
        //cmdBuf[0] = isEn ? OPCODE_EN4B : OPCODE_EX4B;
        cmdBuf[u8CmdSize++] = isEn ? OPCODE_EN4B : OPCODE_EX4B;
    }

    SPIM_SET_SS_EN(spim, 1);                      /* CS activated.    */

    SwitchNBitOutput(spim, u32NBit);
    spim_write(spim, cmdBuf, u8CmdSize);

    SPIM_SET_SS_EN(spim, 0);

    SPIM_SET_DTR_MODE(spim, 0); /* DTR Deactivated. */
}

/**
  * @brief      Issue Winbond Write Config Register command. This command write both Status Register-1
  *             and Status Register-2.
  * @param      dataBuf     Transmit buffer.
  * @param      u32NTx      Size of transmit buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
void SPIM_WriteConfigRegister(SPIM_T *spim, uint8_t u8CMD, uint32_t u32Addr, uint8_t u8Data, uint32_t u32NBit)
{
    uint8_t cmdBuf[4] = {0x0U};
    uint32_t u32BufIdx = 0;

    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO); /* Switch back to Normal mode. */

    SPIM_Set_Write_Enable(spim, 1, 1);

    SPIM_SET_SS_EN(spim, 1);                    /* CS activated.    */

    SwitchNBitOutput(spim, u32NBit);

    cmdBuf[0] = u8CMD;
    spim_write(spim, cmdBuf, 1UL);

    //cmdBuf[u32BufIdx++] = (uint8_t)(u32Addr >> 24);
    cmdBuf[u32BufIdx++] = (uint8_t)(u32Addr >> 16);
    cmdBuf[u32BufIdx++] = (uint8_t)(u32Addr >> 8);
    cmdBuf[u32BufIdx++] = (uint8_t) u32Addr;
    spim_write(spim, cmdBuf, u32BufIdx);

    cmdBuf[0] = u8Data;
    spim_write(spim, cmdBuf, 1UL);

    SPIM_SET_SS_EN(spim, 0);                    /* CS deactivated.  */

    SPIM_Wait_Write_Done(spim, 1UL);
}

/**
  * @brief      Issue Read Status Register #3 command.
  * @param      dataBuf     Receive buffer.
  * @param      u32NRx      Size of receive buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
void SPIM_ReadConfigRegister(SPIM_T *spim, uint8_t u8RdCMD, uint32_t u32Addr, uint8_t dataBuf[], uint32_t u32NRx, uint32_t u32NBit)
{
    uint8_t cmdBuf[8] = {0};
    uint32_t buf_idx = 0;

    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO); /* Switch back to Normal mode.  */

    SPIM_SET_SS_EN(spim, 1);                        /* CS activated. */

    cmdBuf[0] = u8RdCMD;
    SwitchNBitOutput(spim, u32NBit);
    spim_write(spim, cmdBuf, 1UL);                  /* Write out command. */

    buf_idx = 0;
    cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 24);
    cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
    cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
    cmdBuf[buf_idx++] = (uint8_t) u32Addr;
    buf_idx++;//for dummy cycle
    spim_write(spim, cmdBuf, buf_idx);              /* Write out Address. */

    SwitchNBitInput(spim, u32NBit);
    spim_read(spim, dataBuf, u32NRx);               /* Read back data. */

    SPIM_SET_SS_EN(spim, 0);                        /* CS deactivated. */
}

#if 0  /* not used */
/**
  * @brief      Issue Write Security Register command.
  * @param      dataBuf     Transmit buffer.
  * @param      u32NTx      Size of transmit buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
static void SPIM_WriteSecurityRegister(uint8_t dataBuf[], uint32_t u32NTx, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = {OPCODE_WRSCUR, 0x00U};   /* 1-byte Write Status Register #2 command + 1-byte data. */
    cmdBuf[1] = dataBuf[0];

    SPIM_SET_SS_EN(1);                          /* CS activated. */
    SwitchNBitOutput(u32NBit);
    spim_write(cmdBuf, sizeof(cmdBuf));
    SPIM_SET_SS_EN(0);                          /* CS deactivated. */
}
#endif

/**
  * @brief      Issue Read Security Register command.
  * @param      dataBuf     Receive buffer.
  * @param      u32NRx      Size of receive buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
static void SPIM_ReadSecurityRegister(SPIM_T *spim, uint8_t dataBuf[], uint32_t u32NRx, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = {OPCODE_RDSCUR};     /* 1-byte Read Status Register #1 command. */

    SPIM_SET_SS_EN(spim, 1);                /* CS activated. */

    SwitchNBitOutput(spim, u32NBit);
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SwitchNBitInput(spim, u32NBit);
    spim_read(spim, dataBuf, u32NRx);

    SPIM_SET_SS_EN(spim, 0);                /* CS deactivated. */
}

/**
  * @brief      Check if Erase/Write is done.
  * @return     0: Not done. 1: Done.
  */
static int spim_is_write_done(SPIM_T *spim, uint32_t u32NBit)
{
    uint8_t status[1];
    SPIM_ReadStatusRegister(spim, status, sizeof(status), u32NBit);
    return !(status[0] & SR_WIP);
}

/**
  * @brief      Wait until Erase/Write done.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     0           SPIM write done.
  */
int SPIM_Wait_Write_Done(SPIM_T *spim, uint32_t u32NBit)
{
    uint32_t   count;
    int        ret = -1;

    for (count = 0UL; count < SystemCoreClock / 1000UL; count++)
    {
        if (spim_is_write_done(spim, u32NBit))
        {
            ret = 0;
            break;
        }
    }

    if (ret != 0)
    {
        SPIM_DBGMSG("SPIM_Wait_Write_Done time-out!!\n");
    }

    return ret;
}

/**
  * @brief      Issue Write Enable/disable command.
  * @param      isEn        Enable/disable.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
void SPIM_Set_Write_Enable(SPIM_T *spim, int isEn, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = {0U};            /* 1-byte Write Enable command. */
    cmdBuf[0] = isEn ? OPCODE_WREN : OPCODE_WRDI;

    SPIM_SET_SS_EN(spim, 1);            /* CS activated. */

    SwitchNBitOutput(spim, u32NBit);
    spim_write(spim, cmdBuf, sizeof(cmdBuf));

