wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
    if (SPIM_WaitSPIMENDone(spim, 1) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    //SPIM_SET_GO(spim);
    //u32TimeOutCount = SPIM_TIMEOUT;
    //SPIM_WAIT_FREE(spim)
    //{
    //    if (--u32TimeOutCount == 0)
    //        return SPIM_ERR_TIMEOUT;
    //}

    SPIM_SET_SS_EN(spim, 0);

    SPIM_SetQuadEnable(spim, 0, 1);

    return 0;
}

/**
  * @brief      Set Quad Enable/disable.
  * @param      isEn        Enable/disable.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
void SPIM_SetQuadEnable(SPIM_T *spim, int isEn, uint32_t u32NBit)
{
    uint8_t  idBuf[3];
    uint8_t  dataBuf[2];

    SPIM_ReadJedecId(spim, idBuf, sizeof(idBuf), u32NBit);

    SPIM_DBGMSG("SPIM_SetQuadEnable - Flash ID is 0x%x\n", idBuf[0]);

    switch (idBuf[0])
    {
        case MFGID_WINBOND:                      /* Winbond SPI flash  */
            SPIM_ReadStatusRegister(spim, &dataBuf[0], 1UL, u32NBit);
            SPIM_ReadStatusRegister2(spim, &dataBuf[1], 1UL, u32NBit);
            SPIM_DBGMSG("Status Register: 0x%x - 0x%x\n", dataBuf[0], dataBuf[1]);

            if (isEn)
            {
                dataBuf[1] |= SR2_QE;
            }
            else
            {
                dataBuf[1] &= ~SR2_QE;
            }

            SPIM_Set_Write_Enable(spim, 1, u32NBit);   /* Write Enable.    */
            SPIM_WriteStatusRegister2(spim, dataBuf, sizeof(dataBuf), u32NBit);
            SPIM_Wait_Write_Done(spim, u32NBit);

            SPIM_ReadStatusRegister(spim, &dataBuf[0], 1UL, u32NBit);
            SPIM_ReadStatusRegister2(spim, &dataBuf[1], 1UL, u32NBit);
            SPIM_DBGMSG("Status Register: 0x%x - 0x%x\n", dataBuf[0], dataBuf[1]);
            break;

        case MFGID_MXIC:                         /* MXIC SPI flash.  */
        case MFGID_EON:
        case MFGID_ISSI:                               /* ISSI SPI flash.  */
            SPIM_Set_Write_Enable(spim, 1, u32NBit);   /* Write Enable.    */
            dataBuf[0] = isEn ? SR_QE : 0U;
            SPIM_WriteStatusRegister(spim, dataBuf, sizeof(dataBuf), u32NBit);
            SPIM_Wait_Write_Done(spim, u32NBit);
            break;

        case MFGID_SPANSION:
            spim_enable_spansion_quad_mode(spim, isEn);
            break;

        default:
            break;
    }
}

/**
  * @brief      Enter/exit QPI mode.
  * @param      isEn        Enable/disable.
  * @return     None.
  */
static void spim_eon_set_qpi_mode(SPIM_T *spim, int isEn)
{
    uint8_t cmdBuf[1];                                  /* 1-byte command. */

    uint8_t status[1];
    SPIM_ReadStatusRegister(spim, status, sizeof(status), 1UL);
    SPIM_DBGMSG("Status: 0x%x\n", status[0]);

    if (isEn)                                           /* Assume in SPI mode. */
    {
        cmdBuf[0] = OPCODE_ENQPI;

        SPIM_SET_SS_EN(spim, 1);                        /* CS activated. */
        SwitchNBitOutput(spim, 1UL);
        spim_write(spim, cmdBuf, sizeof(cmdBuf));
        SPIM_SET_SS_EN(spim, 0);                        /* CS deactivated. */
    }
    else                                                /* Assume in QPI mode. */
    {
        cmdBuf[0] = OPCODE_EXQPI;

        SPIM_SET_SS_EN(spim, 1);                        /* CS activated. */
        SwitchNBitOutput(spim, 4UL);
        spim_write(spim, cmdBuf, sizeof(cmdBuf));
        SPIM_SET_SS_EN(spim, 0);                        /* CS deactivated. */
    }

    SPIM_ReadStatusRegister(spim, status, sizeof(status), 1UL);
    SPIM_DBGMSG("Status: 0x%x\n", status[0]);
}

static void SPIM_SPANSION_4Bytes_Enable(SPIM_T *spim, int isEn, uint32_t u32NBit)
{
    uint8_t cmdBuf[2];
    uint8_t dataBuf[1];

    cmdBuf[0] = OPCODE_BRRD;

    SPIM_SET_SS_EN(spim, 1);                     /* CS activated. */

    SwitchNBitOutput(spim, u32NBit);
    spim_write(spim, cmdBuf, 1UL);
    SwitchNBitInput(spim, 1UL);
    spim_read(spim, dataBuf, 1UL);

    SPIM_SET_SS_EN(spim, 0);                     /* CS deactivated. */

    SPIM_DBGMSG("Bank Address register= 0x%x\n", dataBuf[0]);

    cmdBuf[0] =  OPCODE_BRWR;

    if (isEn)
    {
        cmdBuf[1] = dataBuf[0] | 0x80U;          /* set EXTADD */
    }
    else
    {
        cmdBuf[1] = dataBuf[0] & ~0x80U;         /* clear EXTADD */
    }

    SPIM_SET_SS_EN(spim, 1);                     /* CS activated. */

    SwitchNBitOutput(spim, 1UL);
    spim_write(spim, cmdBuf, 2UL);

    SPIM_SET_SS_EN(spim, 0);                     /* CS deactivated. */
}

/** @cond HIDDEN_SYMBOLS */

/**
  * @brief      Query 4-byte address mode enabled or not.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     0: 4-byte address mode disabled. 1: 4-byte address mode enabled.
  */
int SPIM_Is4ByteModeEnable(SPIM_T *spim, uint32_t u32NBit)
{
    int  isEn = 0;
    int  isSupt = 0;
    uint8_t  idBuf[3];
    uint8_t  dataBuf[1];

    SPIM_ReadJedecId(spim, idBuf, sizeof(idBuf), u32NBit);

    /* Based on Flash size, check if 4-byte address mode is supported.  */
    switch (idBuf[0])
    {
        case MFGID_WINBOND:
        case MFGID_MXIC:
        case MFGID_EON:
            isSupt = (idBuf[2] < 0x19U) ? 0L : 1L;
            break;

        case MFGID_ISSI:
            isSupt = (idBuf[2] < 0x49U) ? 0L : 1L;
            break;

        case MFGID_MICRON:
            SPIM_ReadMT35XFlagRegister(spim, dataBuf, sizeof(dataBuf), u32NBit);
            isEn = !!(dataBuf[0] & SR3_ADR);
            break;

        default:
            break;
    }

    if (isSupt != 0)
    {
        if (idBuf[0] == MFGID_WINBOND)
        {
            /* Winbond SPI flash. */
            SPIM_ReadStatusRegister3(spim, dataBuf, sizeof(dataBuf), u32NBit);
            isEn = !!(dataBuf[0] & SR3_ADR);
        }
        else if ((idBuf[0] == MFGID_MXIC) || (idBuf[0] == MFGID_EON))
        {
            /* MXIC/EON SPI flash. */
            SPIM_ReadSecurityRegister(spim, dataBuf, sizeof(dataBuf), u32NBit);
            isEn = !!(dataBuf[0] & SCUR_4BYTE);
        }
    }

    return isEn;
}

