wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
/** @endcond HIDDEN_SYMBOLS  */


/**
  * @brief      Enter/Exit 4-byte address mode.
  * @param      isEn        Enable/disable.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     0           success
  *             -1          failed
  */
int SPIM_Enable_4Bytes_Mode(SPIM_T *spim, int isEn, uint32_t u32NBit)
{
    int  isSupt = 0L, ret = -1;
    uint8_t idBuf[3];
    uint8_t cmdBuf[1];                           /* 1-byte Enter/Exit 4-Byte Mode command. */
    int32_t i32TimeOutCount = 0;

    SPIM_ReadJedecId(spim, idBuf, sizeof(idBuf), u32NBit);

    /* Based on Flash size, check if 4-byte address mode is supported. */
    switch (idBuf[0])
    {
        case MFGID_WINBOND:
            isSupt = (idBuf[2] < 0x16U) ? 0L : 1L;
            break;

        case MFGID_MXIC:
        case MFGID_EON:
            isSupt = (idBuf[2] < 0x19U) ? 0L : 1L;
            break;

        case MFGID_ISSI:
            isSupt = (idBuf[2] < 0x49U) ? 0L : 1L;
            break;

        case MFGID_SPANSION:
            SPIM_SPANSION_4Bytes_Enable(spim, isEn, u32NBit);
            isSupt = 1L;
            ret = 0L;
            break;

        case MFGID_MICRON:
            SPIM_Set_Write_Enable(spim, 1, 1);
            isSupt = 1;
            break;

        default:
            break;
    }

    if ((isSupt) && (idBuf[0] != MFGID_SPANSION))
    {
        cmdBuf[0] = isEn ? OPCODE_EN4B : OPCODE_EX4B;

        SPIM_SET_SS_EN(spim, 1);                      /* CS activated.    */
        SwitchNBitOutput(spim, u32NBit);
        spim_write(spim, cmdBuf, sizeof(cmdBuf));
        SPIM_SET_SS_EN(spim, 0);                      /* CS deactivated.  */

        /*
         * FIXME: Per test, 4BYTE Indicator bit doesn't set after EN4B, which
         * doesn't match spec(MX25L25635E), so skip the check below.
         */
        ret = 0;

        if (idBuf[0] != MFGID_MXIC)
        {
            /*
             *  About over 100 instrucsions executed, just want to give
             *  a time-out about 1 seconds to avoid infinite loop
             */
            i32TimeOutCount = (SystemCoreClock) / 100;

            if (isEn)
            {
                while ((i32TimeOutCount-- > 0) && !SPIM_Is4ByteModeEnable(spim, u32NBit)) { }
            }
            else
            {
                while ((i32TimeOutCount-- > 0) && SPIM_Is4ByteModeEnable(spim, u32NBit)) { }
            }

            if (i32TimeOutCount <= 0)
                ret = -1;
        }
    }

    return ret;
}

void SPIM_WinbondUnlock(SPIM_T *spim, uint32_t u32NBit)
{
    uint8_t   idBuf[3];
    uint8_t   dataBuf[4];

    SPIM_ReadJedecId(spim, idBuf, sizeof(idBuf), u32NBit);

    if ((idBuf[0] != MFGID_WINBOND) || (idBuf[1] != 0x40) || (idBuf[2] != 0x16))
    {
        SPIM_DBGMSG("SPIM_WinbondUnlock - Not W25Q32, do nothing.\n");
        return;
    }

    SPIM_ReadStatusRegister(spim, &dataBuf[0], 1UL, u32NBit);
    SPIM_ReadStatusRegister2(spim, &dataBuf[1], 1UL, u32NBit);
    SPIM_DBGMSG("Status Register: 0x%x - 0x%x\n", dataBuf[0], dataBuf[1]);
    dataBuf[1] &= ~0x40;    /* clear Status Register-1 SEC bit */

    SPIM_Set_Write_Enable(spim, 1, u32NBit);   /* Write Enable.    */
    SPIM_WriteStatusRegister2(spim, dataBuf, sizeof(dataBuf), u32NBit);
    SPIM_Wait_Write_Done(spim, u32NBit);

    SPIM_ReadStatusRegister(spim, &dataBuf[0], 1UL, u32NBit);
    SPIM_ReadStatusRegister2(spim, &dataBuf[1], 1UL, u32NBit);
    SPIM_DBGMSG("Status Register (after unlock): 0x%x - 0x%x\n", dataBuf[0], dataBuf[1]);
}

/**
  * @brief      Erase whole chip.
  * @param      u32NBit     N-bit transmit/receive.
  * @param      isSync      Block or not.
  * @return     None.
  */
void SPIM_ChipErase(SPIM_T *spim, uint32_t u32NBit, int isSync)
{
    uint8_t cmdBuf[] = { OPCODE_CHIP_ERASE };    /* 1-byte Chip Erase command. */

    SPIM_Set_Write_Enable(spim, 1, u32NBit);           /* Write Enable.    */

    SPIM_SET_SS_EN(spim, 1);                          /* CS activated.    */
    SwitchNBitOutput(spim, u32NBit);
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SPIM_SET_SS_EN(spim, 0);                          /* CS deactivated.  */

    if (isSync)
    {
        SPIM_Wait_Write_Done(spim, u32NBit);
    }
}

/**
  * @brief      Erase one block.
  * @param      u32Addr         Block to erase which contains the u32Addr.
  * @param      is4ByteAddr     4-byte u32Address or not.
  * @param      u8ErsCmd        Erase command.
  * @param      u32NBit         N-bit transmit/receive.
  * @param      isSync      Block or not.
  * @return     None.
  */
void SPIM_EraseBlock(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr, uint8_t u8ErsCmd, uint32_t u32NBit, int isSync)
{
    uint8_t  cmdBuf[16];
    uint32_t  buf_idx = 0UL;

    SPIM_Set_Write_Enable(spim, 1, u32NBit);           /* Write Enable.    */

    cmdBuf[buf_idx++] = u8ErsCmd;

    if (is4ByteAddr)
    {
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 24);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr & 0xFFUL);
    }
    else
    {
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr & 0xFFUL);
    }

    SPIM_SET_SS_EN(spim, 1);                      /* CS activated.    */
    SwitchNBitOutput(spim, u32NBit);
    spim_write(spim, cmdBuf, buf_idx);
    SPIM_SET_SS_EN(spim, 0);                      /* CS deactivated.  */

    if (isSync)
    {
        SPIM_Wait_Write_Done(spim, u32NBit);
    }
}

/** @cond HIDDEN_SYMBOLS */

/**
  * @brief      Write data in the same page by I/O mode.
  * @param      u32Addr     Start u32Address to write.
  * @param      is4ByteAddr 4-byte u32Address or not.
  * @param      u32NTx      Number of bytes to write.
  * @param      pu8TxBuf    Transmit buffer.
  * @param      wrCmd       Write command.
  * @param      u32NBitCmd  N-bit transmit command.
  * @param      u32NBitAddr N-bit transmit u32Address.
  * @param      u32NBitDat  N-bit transmit/receive data.
  * @param      isSync      Block or not.
  * @return     None.
  */
static void SPIM_WriteInPageDataByIo(SPIM_T *spim, uint32_t u32Addr,
                                     int is4ByteAddr, uint32_t u32NTx,
                                     uint8_t pu8TxBuf[], uint8_t wrCmd,
                                     uint32_t u32NBitCmd, uint32_t u32NBitAddr,
                                     uint32_t u32NBitDat, int isSync)
{
    uint8_t   cmdBuf[16];
    uint32_t  buf_idx;

    SPIM_Set_Write_Enable(spim, 1, u32NBitCmd);         /* Write Enable. */

    SPIM_SET_SS_EN(spim, 1);                            /* CS activated. */

