wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
    pageOffset = u32Addr % 256UL;

    if ((pageOffset + u32NTx) <= 256UL)
    {
        /* Do all the bytes fit onto one page ? */
        SPIM_WriteInPageDataByPageWrite(spim, u32Addr, is4ByteAddr, u32NTx, pu8TxBuf, wrCmd, 1);
    }
    else
    {
        toWr = 256UL - pageOffset;               /* Size of data remaining on the first page. */

        SPIM_WriteInPageDataByPageWrite(spim, u32Addr, is4ByteAddr, toWr, &pu8TxBuf[buf_idx], wrCmd, 1);

        u32Addr += toWr;                         /* Advance indicator. */
        u32NTx -= toWr;
        buf_idx += toWr;

        while (u32NTx)
        {
            toWr = 256UL;

            if (toWr > u32NTx)
            {
                toWr = u32NTx;
            }

            SPIM_WriteInPageDataByPageWrite(spim, u32Addr, is4ByteAddr, toWr, &pu8TxBuf[buf_idx], wrCmd, 1);

            u32Addr += toWr;                 /* Advance indicator. */
            u32NTx -= toWr;
            buf_idx += toWr;
        }
    }
}

/**
  * @brief      Read data from SPI Flash by Page Read mode.
  * @param      u32Addr     Start address to read.
  * @param      is4ByteAddr 4-byte u32Address or not.
  * @param      u32NRx      Number of bytes to read.
  * @param      pu8RxBuf    Receive buffer.
  * @param      u32RdCmd    Read command.
  * @param      isSync      Block or not.
  * @retval     SPIM_OK          SPIM operation OK.
  * @retval     SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  * @note       This function sets g_SPIM_i32ErrCode to SPIM_TIMEOUT_ERR,
  *             if waiting SPIM time-out.
  */
int32_t SPIM_DMA_Read(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr,
                      uint32_t u32NRx, uint8_t pu8RxBuf[], uint32_t u32RdCmd, int isSync)
{
    SPIM_SET_4BYTE_ADDR_EN(spim, is4ByteAddr);        /* Enable/disable 4-Byte Address. */

    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_PAGEREAD); /* Switch to Page Read mode.      */

    SPIM_SET_SPIM_MODE(spim, u32RdCmd);               /* SPIM mode.                     */

    spim->SRAMADDR = (uint32_t) pu8RxBuf;        /* SRAM u32Address. */
    spim->DMACNT = u32NRx;                       /* Transfer length. */
    spim->FADDR = u32Addr;                       /* Flash u32Address.*/

    if (SPIM_WaitSPIMENDone(spim, isSync) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/**
  * @brief      Enter Direct Map mode.
  * @param      is4ByteAddr     4-byte u32Address or not.
  * @param      u32RdCmd        Read command.
  * @param      u32IdleIntvl    Idle interval.
  * @return     None.
  */
void SPIM_EnterDirectMapMode(SPIM_T *spim, int is4ByteAddr,
                             uint32_t u32RdCmd, uint32_t u32IdleIntvl)
{
    SPIM_SET_4BYTE_ADDR_EN(spim, is4ByteAddr);           /* Enable/disable 4-byte u32Address. */
    SPIM_SET_SPIM_MODE(spim, u32RdCmd);                  /* SPIM mode. */
    SPIM_SET_IDL_INTVL(spim, u32IdleIntvl);              /* Idle interval. */
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_DIRECTMAP);   /* Switch to Direct Map mode. */
}

/**
  * @brief      Exit Direct Map mode.
  * @param      spim
  * @return     SPIM_OK          SPIM operation OK.
  *             SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  */
int SPIM_ExitDirectMapMode(SPIM_T *spim)
{
    uint32_t u32CmdBuf = 0xFFFFFFFF;
    spim->TX[0] = u32CmdBuf;

    SPIM_SetQuadEnable(spim, 1, 1);

    SPIM_SET_SS_EN(spim, 1);

    SwitchNBitOutput(spim, 4UL);
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);    /* Switch to Normal mode. */
    SPIM_SET_DATA_WIDTH(spim, 32UL);
    SPIM_SET_BURST_DATA(spim, 1);

    if (SPIM_WaitSPIMENDone(spim, 1) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    SPIM_SET_SS_EN(spim, 0);

    SPIM_SetQuadEnable(spim, 0, 1);

    spim->TX[0] = u32CmdBuf;

    SPIM_SET_SS_EN(spim, 1);

    SwitchNBitOutput(spim, 2UL);
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);    /* Switch to Normal mode. */
    SPIM_SET_DATA_WIDTH(spim, 32UL);
    SPIM_SET_BURST_DATA(spim, 1);

    if (SPIM_WaitSPIMENDone(spim, 1) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    SPIM_SET_SS_EN(spim, 0);

    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO); /* Switch back to Normal mode.  */

#if 0
    uint8_t cmdBuf[3] = {0x0F, 0xFF, 0xFF};

    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO); /* Switch back to Normal mode.  */

    /* SPI Reset */
    SPIM_SET_SS_EN(spim, 1);                          /* CS activated.    */

    SPIM_ENABLE_SING_OUTPUT_MODE(spim);               /* 1-bit, Output.   */

    spim_write(spim, cmdBuf, sizeof(cmdBuf));

    SPIM_SET_SS_EN(spim, 0);

    uint8_t cmdBuf[4] = {0xFF, 0xFF, 0xFF, 0xFF};

    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO); /* Switch back to Normal mode.  */
    SPIM_ENABLE_QUAD_OUTPUT_MODE(spim);         /* Switch back to Normal mode.  */
    SPIM_SET_BURST_DATA(spim, 0);
    SPIM_SET_DATA_WIDTH(spim, 32UL);

    SPIM_SET_SS_EN(spim, 1);                          /* CS activated. */
    SwitchNBitOutput(spim, 4);
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SPIM_SET_SS_EN(spim, 0);

    SPIM_DMM_DISABLE_BWEN(spim);
#endif //0

    return 0;
}

/**
  * @brief      SPIM used to delay the read data strobe (DQS/RWDS) from Octal SPI Flash and Hyper bus device
  * @param      spim
  * @param      u32ClkOnNum Clock Cycle Number between DLL OLDO Enable and DLL Clock Divider Enable
  * @param      u32TrimNum  Clock Cycle Number between DLL Output Valid and DLL Auto Trim Enable
  * @param      u32LKNum    Clock Cycle Number between DLL Clock Divider Enable and DLL Lock
  * @param      u32OVNum    Clock Cycle Number between DLL Lock and DLL Output Valid
  * @param      u32DelayNum DLL Delay Step Number
  * @return     None.
  * @note       First fix DIVIDER to set the frequency of SPIM output bus clock.
  */
void SPIM_CtrlDLLDelayTime(SPIM_T *spim, uint32_t u32ClkOnNum, uint32_t u32TrimNum,
                           uint32_t u32LKNum, uint32_t u32OVNum, uint32_t u32DelayNum)
{
    int i32Timeout = SPIM_TIMEOUT;

    /* The default value of CLKONNUM is 0x07D0 when frequency of DLL reference clock
       is 100 MHz and enable time of DLL clock divider is 20us */
    if (u32ClkOnNum != 0)
    {
        SPIM_SET_DLL2_CLKON_NUM(spim, u32ClkOnNum);
    }

    if (u32TrimNum != 0)
    {
        SPIM_SET_DLL2_TRIM_NUM(spim, u32TrimNum);
    }

    /* The default value of DLLLKNUM is 0x07D0 when frequency of DLL reference clock
       is 100 MHz and DLL lock time is 20us. */
    if (u32LKNum != 0)
    {
        SPIM_SET_DLL1_LOCKK_VALID(spim, u32LKNum);
    }

    if (u32OVNum != 0)
    {
        SPIM_SET_DLL1_OUT_VALID(spim, u32OVNum);
    }

