wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
    spim->HYPER_CMD = SPIM_HYPER_CMD_WRITE_HRAM_1_BYTE;

    if (SPIM_Hyper_WaitCMDIDLE(spim) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/**
  * @brief      Write 2 bytes to Hyper Chip space
  * @param      spim
  * @param[in]  u32Addr  Address of Hyper Chip space
  * @param[in]  u16Data  16 bits data to be written to Hyper Chip space
  * @return     None.
  * @note       This function sets SPIM_ERR_TIMEOUT if waiting Hyper Chip time-out.
  */
int SPIM_Hyper_Write2Byte(SPIM_T *spim, uint32_t u32Addr, uint16_t u16Data)
{
    int32_t i32TimeOutCnt = SPIM_TIMEOUT;

    spim->HYPER_WDATA &= ~0xFFFFFFFF;

    spim->HYPER_ADR = u32Addr;
    spim->HYPER_WDATA = u16Data;

    spim->HYPER_CMD = SPIM_HYPER_CMD_WRITE_HRAM_2_BYTE;

    if (SPIM_Hyper_WaitCMDIDLE(spim) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/**
  * @brief      Write 3 bytes to Hyper Chip space
  * @param      spim
  * @param[in]  u32Addr  Address of Hyper Chip space
  * @param[in]  u32Data  24 bits data to be written to Hyper Chip space
  * @return     None.
  * @note       This function sets SPIM_ERR_TIMEOUT if waiting Hyper Chip time-out.
  */
int SPIM_Hyper_Write3Byte(SPIM_T *spim, uint32_t u32Addr, uint32_t u32Data)
{
    int32_t i32TimeOutCnt = SPIM_TIMEOUT;

    spim->HYPER_WDATA &= ~0xFFFFFFFF;

    spim->HYPER_ADR = u32Addr;
    spim->HYPER_WDATA = u32Data;

    spim->HYPER_CMD = SPIM_HYPER_CMD_WRITE_HRAM_3_BYTE;

    if (SPIM_Hyper_WaitCMDIDLE(spim) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/**
  * @brief      Write 4 byte to hyper chip space
  * @param      spim
  * @param[in]  u32Addr  Address of hyper chip space
  * @param[in]  u32Data  32 bits data to be written to hyper chip space
  * @return     None.
  * @note       This function sets SPIM_ERR_TIMEOUT if waiting Hyper Chip time-out.
  */
int SPIM_Hyper_Write4Byte(SPIM_T *spim, uint32_t u32Addr, uint32_t u32Data)
{
    int32_t i32TimeOutCnt = SPIM_TIMEOUT;

    spim->HYPER_WDATA &= ~0xFFFFFFFF;

    spim->HYPER_ADR = u32Addr;
    spim->HYPER_WDATA = u32Data;

    spim->HYPER_CMD = SPIM_HYPER_CMD_WRITE_HRAM_4_BYTE;

    if (SPIM_Hyper_WaitCMDIDLE(spim) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/**
  * @brief      SPIM Default Config HyperBus Access Module Parameters.
  * @param      spim
  * @param      u32CSMaxLT Chip Select Maximum Low Time
  * @param      u32AcctRD Initial Read Access Time
  * @param      u32AcctWR Initial Write Access Time
  * @return     None.
  */
void SPIM_Hyper_DefConfig(SPIM_T *spim, uint32_t u32CSMaxLow, uint32_t u32AcctRD, uint32_t u32AcctWR)
{
    /* Chip Select Setup Time 2.5 */
    SPIM_HYPER_CONFIG1_SET_CSST(spim, SPIM_HYPER_CONFIG1_CSST_2_5_HCLK);

    /* Burst Group Size 32Bits */
    //SPIM_HYPER_CONFIG1_SET_BGSIZE(spim, u32BSize);

    /* Chip Select Hold Time 2.5 HCLK */
    SPIM_HYPER_CONFIG1_SET_CSH(spim, SPIM_HYPER_CONFIG1_CSH_2_5_HCLK);

    /* Chip Select High between Transaction as 1 HCLK cycles */
    SPIM_HYPER_CONFIG1_SET_CSHI(spim, 2);

    /* Chip Select Masximum low time 71 HCLK */
    SPIM_HYPER_CONFIG1_SET_CSMAXLT(spim, u32CSMaxLow);

    /* Initial Device RESETN Low Time 0 */
    SPIM_HYPER_CONFIG2_SET_RSTNLT(spim, 0xFF);

    /* Initial Read Access Time 7 Clock cycle*/
    SPIM_HYPER_CONFIG2_SET_ACCTRD(spim, u32AcctRD);

    /* Initial Write Access Time 7 Clock cycle*/
    SPIM_HYPER_CONFIG2_SET_ACCTWR(spim, u32AcctWR);
}

/**
  * @brief      Write data to HyperBus Module.
  * @param      u32Addr Start address to write.
  * @param      pvWrBuf Transmit buffer.
  * @param      u32NTx  Number of bytes to write.
  * @return     None.
  */
int SPIM_Hyper_DMAWrite(SPIM_T *spim, uint32_t u32Addr, void *pvWrBuf, uint32_t u32NTx)
{
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_PAGEWRITE);  /* Switch to DMA Write mode.   */

    spim->SRAMADDR = (uint32_t) pvWrBuf;         /* SRAM u32Address.  */
    spim->DMACNT = u32NTx;                       /* Transfer length.  */
    spim->FADDR = u32Addr;                       /* Flash u32Address. */

    if (SPIM_WaitSPIMENDone(spim, 1) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/**
  * @brief      Read data from HyperBus Module.
  * @param      u32Addr Start address to read.
  * @param      pvRdBuf Receive buffer.
  * @param      u32NRx  Number of bytes to read.
  * @return     None.
  */
int SPIM_Hyper_DMARead(SPIM_T *spim, uint32_t u32Addr, void *pvRdBuf, uint32_t u32NRx)
{
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_PAGEREAD);  /* Switch to DMA Write mode.   */

    spim->SRAMADDR = (uint32_t) pvRdBuf;         /* SRAM u32Address. */
    spim->DMACNT = u32NRx;                       /* Transfer length. */
    spim->FADDR = u32Addr;                       /* Flash u32Address. */

    if (SPIM_WaitSPIMENDone(spim, 1) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/**
  * @brief      SPIM Hyper Mode Enter DMM Mode
  * @param      spim
  * @return     None.
  * @note       This function sets SPIM_ERR_TIMEOUT if waiting Hyper Chip time-out.
  */
int SPIM_Hyper_EnterDirectMapMode(SPIM_T *spim)
{
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_DIRECTMAP);  /* Switch to DMA Write mode.   */

    return SPIM_OK;
}

/**
  * @brief      SPIM Hyper Mode Exit DMM Mode
  * @param      spim
  * @return     None.
  * @note       This function sets SPIM_ERR_TIMEOUT if waiting Hyper Chip time-out.
  */
void SPIM_Hyper_ExitDirectMapMode(SPIM_T *spim)
{
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);       /* Switch back to Normal mode.  */
}

/**
  * @brief      SPIM Hyper Mode Exit DMM Mode
  * @param      spim
  * @return     None.
  * @note       This function sets SPIM_ERR_TIMEOUT if waiting Hyper Chip time-out.
  */
int SPIM_Hyper_WaitDMMDone(SPIM_T *spim)
{
    uint32_t u32TimeOutCount = SPIM_TIMEOUT;

    SPIM_DMM_HYPDONE(spim);       /* HyperBus DMM Mode Done.  */
    //spim->DMMCTL |= SPIM_DMMCTL_HYPDONE_Msk;

    SPIM_WAIT_HYPDONE(spim)
    {
        if (--u32TimeOutCount == 0) return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/** @} end of group SPIM_EXPORTED_FUNCTIONS */
/** @} end of group SPIM_Driver */
/** @} end of group Standard_Driver */
